tap "buo/cask-upgrade" # https://github.com/buo/homebrew-cask-upgrade
# casks are binaries that get installed in my Mac Applications directory
brew "awscli"
brew "brew-gem"
brew "diff-so-fancy"
brew "direnv"
brew "git"
brew "go"
brew "haskell-stack" # used to make zsh prompt render faster
brew "heroku"
brew "htop"
brew "httpie"
brew "hub"
brew "ipcalc"
brew "ipv6calc"
brew "ipv6toolkit"
brew "jq"
brew "mercurial"
brew "nmap"
brew "npm"
brew "pipenv"
brew "pstree"
# brew "pyenv"
# brew "pyenv-ccache"
# brew "pyenv-virtualenv"
# brew "pyenv-which-ext"
brew "python"
brew "python3"
brew "ruby"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
cask "1password"
cask "anaconda"
cask "atom"
cask "dropbox"
cask "evernote"
cask "flux"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "messenger-for-desktop"
cask "ngrok"
cask "slack"
cask "sublime-text"
cask "timemachineeditor"
cask "virtualbox"
cask "visual-studio-code"
cask "wireshark"
